#+TITLE: cf-doc

#+BEGIN_SRC sh :exports results :results output
  exec 2>&1
  ./cf-doc.sh --help
  :
#+END_SRC

#+RESULTS:
#+begin_example
SYNOPSIS
        cf-doc --help
        cf-doc [-f FILE] [-p VERSION] [-u URL] [-t]

DESCRIPTION
        cf-doc will extract particular meta tags and meta promises
        from CFEngine policy and will output a list of them in
        Markdown format, to document and index a codebase of
        CFEngine policy.

        Each line of output is formatted as a URL linking back
        to the line of policy from which it was extracted.
        The -t option can also be used to generate plain text
        (no hyperlinks).

        cf-promises is used internally to parse CFEngine policy and
        generate json output, which is further parsed to produce
        the final script output.

        The particular meta tags and meta promises to be collected
        are as defined in the "collection" variable in this script.
        For further details on this see the inline documentation
        in the supporting script 'extract-cf-meta.jq'.

OPTIONS
        -f FILE         File to pass to cf-promises for parsing.
                        If not specified cf-promises will use its own
                        default of /var/cfengine/inputs/promises.cf

        -p VERSION      Version of the policy that is being checked,
                        for inclusion in the URL.  Default is master.

        -u URL          URL prefix to use for all links.  Default is
                        coded into the script at the top and is intended
                        for modification to suit your site, but can also
                        be overridden on the command line with -u.
                        Current default is https://example.com/cfengine/masterfiles/blob/

        -t              Text only mode.  The -v and -u switches do nothing
                        if this option is passed, as the output will not
                        be markdown formatted as URLs.
#+end_example

